#include<iostream>
#include<math.h>

using namespace std;
	
/*Определить, угрожает ли одна фигура другой. В отсутствии угрозы выяснить
существует ли ход какой-либо из фигур после которого угроза появляется.
На поле (k, l) стоит ладья, на поле (m, n) – конь. */

int main()
{ 
	setlocale(LC_ALL, "Russian");
	int k, l, m, n, m1, n1;
	bool ugr = false;
	cout << "k=";
	cin >> k;
	cout << "l=";
	cin >> l;
	cout << "m=";
	cin >> m;
	cout << "n=";
	cin >> n;
	if (k <= 8 && l <= 8 && m <= 8 && n <= 8 && k > 0 && l > 0 && m > 0 && n > 0)
	{
		if (k == m && l == n)
		{
			ugr = true;
			cout << "Фигуры уже побиты" << endl;
		}
		else
		{
			if (k == m || l == n)
			{
				ugr = true;
				cout << "Ладья угрожает коню" << endl;
			}

			if (((m == k - 2 || m == k + 2) && (n == l + 1 || n == l - 1)) || ((m == k - 1 || m == k + 1) && (n == l + 2 || n == l - 2)))
			{
				ugr = true;
				cout << "Конь угрожает ладье" << endl;
			}
		}

		if (ugr != true)
		{
			cout << "Ладья будет угрожать коню" << endl;
			
			m1 = m + 2;
			n1 = n + 1;
			if ((((m1 == k - 2 || m1 == k + 2) && (n1 == l + 1 || n1 == l - 1)) || ((m1 == k - 1 || m1 == k + 1) && (n1 == l + 2 || n1 == l - 2))) && m1<=8 && n1<=8 && n1>0 && m1>0 && ugr != true)
			{
				ugr = true;
				cout << "Конь будет угрожать ладье" << endl;
			}

			m1 = m - 2;
			n1 = n + 1;
			if ((((m1 == k - 2 || m1 == k + 2) && (n1 == l + 1 || n1 == l - 1)) || ((m1 == k - 1 || m1 == k + 1) && (n1 == l + 2 || n1 == l - 2))) && m1 <= 8 && n1 <= 8 && n1 > 0 && m1 > 0 && ugr != true)
			{
				ugr = true;
				cout << "Конь будет угрожать ладье" << endl;
			}

			m1 = m + 2;
			n1 = n - 1;
			if ((((m1 == k - 2 || m1 == k + 2) && (n1 == l + 1 || n1 == l - 1)) || ((m1 == k - 1 || m1 == k + 1) && (n1 == l + 2 || n1 == l - 2))) && m1 <= 8 && n1 <= 8 && n1 > 0 && m1 > 0 && ugr != true)
			{
				ugr = true;
				cout << "Конь будет угрожать ладье" << endl;
			}

			m1 = m - 2;
			n1 = n - 1;
			if ((((m1 == k - 2 || m1 == k + 2) && (n1 == l + 1 || n1 == l - 1)) || ((m1 == k - 1 || m1 == k + 1) && (n1 == l + 2 || n1 == l - 2))) && m1 <= 8 && n1 <= 8 && n1 > 0 && m1 > 0 && ugr != true)
			{
				ugr = true;
				cout << "Конь будет угрожать ладье" << endl;
			}

			m1 = m + 1;
			n1 = n + 2;
			if ((((m1 == k - 2 || m1 == k + 2) && (n1 == l + 1 || n1 == l - 1)) || ((m1 == k - 1 || m1 == k + 1) && (n1 == l + 2 || n1 == l - 2))) && m1 <= 8 && n1 <= 8 && n1 > 0 && m1 > 0 && ugr != true)
			{
				ugr = true;
				cout << "Конь будет угрожать ладье" << endl;
			}

			m1 = m - 1;
			n1 = n + 2;
			if ((((m1 == k - 2 || m1 == k + 2) && (n1 == l + 1 || n1 == l - 1)) || ((m1 == k - 1 || m1 == k + 1) && (n1 == l + 2 || n1 == l - 2))) && m1 <= 8 && n1 <= 8 && n1 > 0 && m1 > 0 && ugr != true)
			{
				ugr = true;
				cout << "Конь будет угрожать ладье" << endl;
			}

			m1 = m + 1;
			n1 = n - 2;
			if ((((m1 == k - 2 || m1 == k + 2) && (n1 == l + 1 || n1 == l - 1)) || ((m1 == k - 1 || m1 == k + 1) && (n1 == l + 2 || n1 == l - 2))) && m1 <= 8 && n1 <= 8 && n1 > 0 && m1 > 0 && ugr != true)
			{
				ugr = true;
				cout << "Конь будет угрожать ладье" << endl;
			}

			m1 = m - 1;
			n1 = n - 2;
			if ((((m1 == k - 2 || m1 == k + 2) && (n1 == l + 1 || n1 == l - 1)) || ((m1 == k - 1 || m1 == k + 1) && (n1 == l + 2 || n1 == l - 2))) && m1 <= 8 && n1 <= 8 && n1 > 0 && m1 > 0 && ugr != true)
			{
				ugr = true;
				cout << "Конь будет угрожать ладье" << endl;
			}
		}
	}
	else
		cout << "Данные введены неверно" << endl;
	return 0;
}